import React from 'react';
import './Teamblock.css'

export default class TeamBlock extends React.Component {
    render() {
        return (
            <>
                <div className="team_block">
                    <div className="team_header">
                    <span className="team_newt team_svg"><svg width="174" height="174" viewBox="0 0 174 174" fill="none"
                                                     xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M142.256 34.895C156.759 50.2043 164.842 70.4903 164.842 91.5785H131.874C131.874 78.9256 127.024 66.7539 118.322 57.5684C109.62 48.3828 97.7285 42.8821 85.0941 42.1982C72.4596 41.5143 60.0437 45.6993 50.4012 53.8919C40.7587 62.0845 34.6233 73.6615 33.2575 86.2405C31.8918 98.8195 35.3996 111.443 43.059 121.515C50.7185 131.586 61.947 138.338 74.4337 140.382C86.9205 142.425 99.7157 139.605 110.186 132.501C117.253 127.706 122.899 121.206 126.657 113.687H161.822C156.6 132.442 144.887 148.798 128.696 159.783C111.245 171.623 89.9201 176.323 69.1088 172.917C48.2975 169.511 29.5834 158.257 16.8176 141.472C4.05181 124.687 -1.79449 103.647 0.481794 82.6819C2.75808 61.7169 12.9838 42.4219 29.0546 28.7675C45.1254 15.1132 65.8186 8.13824 86.876 9.27805C107.933 10.4179 127.753 19.5857 142.256 34.895Z"
                            fill="black"/>
                        <g filter="url(#filter0_b_43:301)">
                            <path
                                d="M122.496 91.6112C122.496 83.6787 120.144 75.9245 115.737 69.3289C111.33 62.7333 105.066 57.5927 97.7373 54.5571C90.4087 51.5215 82.3445 50.7273 74.5645 52.2748C66.7845 53.8223 59.6381 57.6422 54.0291 63.2512C48.42 68.8603 44.6002 76.0067 43.0526 83.7867C41.5051 91.5667 42.2993 99.6309 45.3349 106.959C48.3706 114.288 53.5112 120.552 60.1067 124.959C66.7023 129.366 74.4566 131.718 82.389 131.718V103.643C80.0093 103.643 77.683 102.938 75.7043 101.615C73.7256 100.293 72.1835 98.4142 71.2728 96.2156C70.3621 94.0171 70.1238 91.5978 70.5881 89.2638C71.0523 86.9298 72.1983 84.7859 73.881 83.1032C75.5637 81.4205 77.7076 80.2745 80.0416 79.8102C82.3756 79.346 84.7949 79.5843 86.9935 80.4949C89.1921 81.4056 91.0712 82.9478 92.3933 84.9265C93.7154 86.9052 94.4211 89.2314 94.4211 91.6112H122.496Z"
                                fill="#C4C4C4" fill-opacity="0.6"/>
                        </g>
                        <g filter="url(#filter1_b_43:301)">
                            <path
                                d="M82.4212 27.4734C74.0028 27.4734 65.6668 29.1315 57.8892 32.3531C50.1116 35.5747 43.0446 40.2967 37.0919 46.2494C31.1392 52.2021 26.4172 59.269 23.1956 67.0466C19.974 74.8242 18.3159 83.1602 18.3159 91.5786C18.3159 99.997 19.9741 108.333 23.1956 116.111C26.4172 123.888 31.1392 130.955 37.0919 136.908C43.0446 142.861 50.1116 147.583 57.8892 150.804C65.6668 154.026 74.0028 155.684 82.4212 155.684L82.4212 123.631C78.212 123.631 74.044 122.802 70.1552 121.191C66.2664 119.581 62.7329 117.22 59.7566 114.243C56.7802 111.267 54.4192 107.733 52.8084 103.845C51.1976 99.9558 50.3686 95.7878 50.3686 91.5786C50.3686 87.3694 51.1976 83.2014 52.8084 79.3126C54.4192 75.4238 56.7802 71.8904 59.7566 68.914C62.7329 65.9376 66.2664 63.5767 70.1552 61.9659C74.044 60.3551 78.212 59.526 82.4212 59.526V27.4734Z"
                                fill="#484848" fill-opacity="0.6"/>
                        </g>
                        <path
                            d="M82.4211 9.15747C71.5974 9.15747 60.8797 11.2894 50.8799 15.4314C40.8801 19.5734 31.7941 25.6445 24.1406 33.298C16.4871 40.9515 10.416 50.0376 6.27393 60.0373C2.13188 70.0371 -1.63433e-06 80.7548 0 91.5785L32.9684 91.5785C32.9684 85.0843 34.2476 78.6537 36.7328 72.6538C39.218 66.6539 42.8607 61.2023 47.4528 56.6102C52.0449 52.0181 57.4965 48.3755 63.4964 45.8902C69.4962 43.405 75.9269 42.1259 82.4211 42.1259V9.15747Z"
                            fill="black"/>
                        <path
                            d="M174 91.5789C174 79.5526 171.631 67.644 167.029 56.5332C162.427 45.4223 155.681 35.3267 147.177 26.8228C138.673 18.319 128.578 11.5733 117.467 6.97103C106.356 2.36876 94.4472 -5.25687e-07 82.4209 0L82.4209 59.5263C86.6301 59.5263 90.7981 60.3554 94.6869 61.9661C98.5757 63.5769 102.109 65.9379 105.086 68.9143C108.062 71.8906 110.423 75.4241 112.034 79.3129C113.644 83.2017 114.474 87.3697 114.474 91.5789H174Z"
                            fill="black"/>
                        <ellipse cx="160.263" cy="76.5599" rx="5.49474" ry="5.49473" fill="white"/>
                        <defs>
                            <filter id="filter0_b_43:301" x="-12.718" y="-3.49585" width="190.214" height="190.214"
                                    filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                <feGaussianBlur in="BackgroundImage" stdDeviation="27.5"/>
                                <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_43:301"/>
                                <feBlend mode="normal" in="SourceGraphic" in2="effect1_backgroundBlur_43:301"
                                         result="shape"/>
                            </filter>
                            <filter id="filter1_b_43:301" x="6.31592" y="15.4734" width="88.1052" height="152.21"
                                    filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                <feGaussianBlur in="BackgroundImage" stdDeviation="6"/>
                                <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_43:301"/>
                                <feBlend mode="normal" in="SourceGraphic" in2="effect1_backgroundBlur_43:301"
                                         result="shape"/>
                            </filter>
                        </defs>
                    </svg>
                    </span>
                        <span className="team_newt team_shit">Newt.team</span>

                    </div>
                    <div className="team_shit">
                        <p className="team_description">
                            Мы — команда разработчиков <span className="team_easter">Newt.team</span>. Создаём
                            цифровые<br/>решения, которые экономят время компаний и клиентов.
                            <br/>
                            <div><a href="#solutions"><button className="team_solutions_button">
                                Посмотреть цифровые решения
                            </button></a>
                            </div>
                        </p>

                    </div>

                </div>
                <div className="time_block" id="about-us">
                    <div>
                    <h1 className="time_header">
                        Время - главный ресурс
                    </h1>
                    <ul className="time_list">
                        <li>Время - штука не бесконечная, поэтому наша<br/>команда создает продукты, которые помогают<br/>его экономить.</li>
                        <li>Мы заботимся о работниках компаний - <br/>автоматизируем их действия и освобождаем<br/>время для важных задач.</li>
                        <li>Наши сервисы экономят время клиентов - они<br/>получают продукт в 3-4 клика.</li>
                        <li>Мы ускоряем процессы работы, тем самым<br/>делаем бизнес рациональней.</li>
                    </ul>
                    </div>
                </div>
            </>
        )
    }
}